---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlopedInnerEdge
source: html/213ad957-af1a-6548-a1d8-44171a53b421.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlopedInnerEdge Property

Inner loops of a footprint sketch may not have slope-defining lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId SlopedInnerEdge { get; }
```